<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
</head>
<body>
<h2><u>Ayuda de Douhglator</u></h2>
<h3>Introducci&oacute;n</h3>
<p>Con doughlator podr&aacute; crear y ajustar r&aacute;pidamente sus masas de pan y boller&iacute;a.</p>
<p>La aplicaci&oacute;n se compone de tres vistas principales:</p>
<ul>
<li>Lista de recetas.</li>
<li>Detalle de la receta.</li>
<li>Notas de elaboraci&oacute;n.</li>
</ul>
<h5>Lista de recetas</h5>
<p>Es la ventana principal y desde ella se listar&aacute;n todas las recetas, tanto las creadas
por usted como las recetas incluidas en la aplicaci&oacute;n.</p>
<h5>Detalle de la receta</h5>
<p>En esta vista se podr&aacute;n ajustar los par&aacute;metros de la receta, a&ntilde;adir, editar, borrar ingredientes y enviar la receta por correo electr&oacute;nico.</p>
<p>Desde el men&uacute; est&aacute;n disponibles las opciones tipo de ajuste (Ajuste por peso de ingredientes o ajuste por porcentaje) y duplicado la receta.</p>
<h5>Notas de elaboraci&oacute;n</h5>
<p>La vista de notas permite visualizar, editar y guardar los pasos de elaboraci&oacute;n y sus puntos importantes. </p>
<h3>Lista de recetas</h3>
<h4>A&ntilde;adir receta</h4>
<p>Para a&ntilde;adir una receta basta con pulsar el bot&oacute;n situado en el margen inferior derecho de la lista. En el cuadro que aparece, escribir el nombre de la receta y pulsar el bot&oacute;n OK.
Autom&aacute;ticamente la receta es a&ntilde;adida a la lista con los 4 ingredientes b&aacute;sicos lista para ser editada.</p>
<h4>Borrar receta</h4>
<p>Las recetas se borran desde la lista de recetas. Pulsar durante un tiempo la receta que se desea eliminar. Desde el cuadro de confirmaci&oacute;n aceptar pulsando el bot&oacuten OK.</p>
<h3>Detalle de la receta</h3>
<p>La vista detalle permite ajustar la receta de forma f&aacute;cil y sencilla. La barra de hidrataci&oacute;n indica en todo momento la tasa de hidrataci&oacute;n de la masa con el fin de poder ajustar dicho par&aacute;metro en cualquier momento. Tambi&eacute;n
    se indica el peso de la masa antes de hornear para poder ajustar las cantidades.
A la hora de editar ingredientes es conveniente clasificarlos en tres grupos:</p>
<ul>
    <li>Ingredientes referencia (Harinas).</li>
    <li>Ingredientes l&iacute;quidos.</li>
    <li>Ingredientes s&oacute;lidos.</li>
</ul>
<p>Los ingredientes referencia sirven para ajustar correctamente el resto de ingredientes de la receta y calcular la tasa de hidrataci&oacute;n. Al crear una nueva receta, siempre se a&ntilde;ade la harina en la primera posici&oacute;n. Este elemento adem&aacute;s de ingrediente
    referencia, es ingrediente base y es imprescindible para ajustar el resto de ingredientes referencia. <u>No es posible eliminar la harina base</u>. Se considera ingrediente referencia a todo tipo de harina proveniente de un cereal.
    Los ingredientes l&iacute;quidos influyen directamente en la hidrataci&oacute;n de la masa. Se consideran l&iacute;quidos ingredientes como el agua, leche, aceites, huevo. Los ingredientes que no son referencia ni l&iacute;quidos se consideran s&oacute;lidos. Es muy importante tener en cuenta esta clasificaci&oacute;n
    para poder elaborar correctamente la receta.
</p>
<h4>Insertar ingredientes</h4>
<p>Los ingredientes nuevos se insertan desde el bot&oacute;n "+" de la barra de herramientas. Escribir el nombre, poner el porcentaje o cantidad, seg&uacute;n el ajuste seleccionado y marcar el ingrediente como referencia o l&iacute;quido (no marcar nada si no corresponde a ninguno de los dos grupos). Al pulsar el bot&oacute;n OK se a&ntilde;adir&aacute; a la lista
de ingredientes. El ajuste de la receta se realiza autom&aacute;ticamente.</p>
<h4>Editar ingredientes</h4>
<p>Para editar un ingrediente basta con pulsar sobre &eacute;l en la lista de ingredientes y aparecer&aacute; el cuadro de di&aacute;logo. Tras hacer los cambios deseados, al pulsar el bot&oacute;n OK para validar dichos cambios.</p>
<h4>Eliminar ingredientes</h4>
<p>Para eliminar un ingrediente, mantenerlo pulsado hasta que aparezca el cuadro de di&aacute;logo. El resto de ingredientes se recalculan al pulsar el bot&oacute;n OK</p>
<h3>Notas de elaboraci&oacute;n</h3>
<h4>Edici&oacute;n de Notas</h4>
<p>Desde las notas de elaboraci&oacute;n es posible apuntar cualquier cosa de la receta como por ejemplo: amasado, fases de fermentaci&oacute;n, tiempos, temperaturas, etc. Para comenzar a escribir o editar una nota ya existente, pulsar el icono del l&aacute;piz que aparece en la barra de herramientas.
Para finalizar la edici&oacute;n pulsar el icono del disco de la barra de herramientas.</p>

<address>
    Contacto:<br>
    <a href="mailto:rpuertas82@gmail.com">Roberto Puertas Blanco</a><br>
    Azuqueca de Henares, Guadalajara<br>
    Espa&ntildea
</address>

</body>
</html>
