<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
</head>
<body>
<h2><u>Ayuda de Douhglator</u></h2>
<h3>Introducci&oacute;n</h3>
<p>Con doughlator podr&aacute; crear y ajustar r&aacute;pidamente sus masas de pan y boller&iacute;a.</p>
<p>La aplicaci&oacute;n se compone de tres vistas principales:</p>
<ul>
<li>Lista de recetas.</li>
<li>Detalle de la receta.</li>
<li>Notas de elaboraci&oacute;n.</li>
</ul>
<h5>Lista de recetas</h5>
<p>Es la ventana principal y desde ella se listar&aacute;n todas las recetas, tanto las creadas
por usted como las recetas incluidas en la aplicaci&oacute;n.</p>
<h5>Detalle de la receta</h5>
<p>En esta vista se podr&aacute;n ajustar los par&aacute;metros de la receta, a&ntilde;adir, editar, borrar ingredientes y enviar la receta por correo electr&oacute;nico.</p>
<p>Desde el men&uacute; est&aacute;n disponibles las opciones tipo de ajuste (Ajuste por peso de ingredientes o ajuste por porcentaje) y duplicar la receta.</p>
<h5>Notas de elaboraci&oacute;n</h5>
<p>La vista de notas permite visualizar, editar y guardar los pasos de elaboraci&oacute;n y sus puntos importantes. </p>
<h3>Lista de recetas</h3>
<h4>A&ntilde;adir receta</h4>
<p>Para a&ntilde;adir una receta basta con pulsar el bot&oacute;n situado en el margen inferior derecho de la lista. En el cuadro que aparece, escribir el nombre de la receta y pulsar el bot&oacute;n OK.
Autom&aacute;ticamente la receta es a&ntilde;adida a la lista con los 4 ingredientes b&aacute;sicos lista para ser editada.</p>
<h4>Borrar receta</h4>
<p>Las recetas se borran desde la lista de recetas. Pulsar durante un tiempo la receta que se desea eliminar. Desde el cuadro de confirmaci&oacute;n aceptar pulsando el bot&oacuten OK.</p>
<h3>Detalle de la receta</h3>
<h4>Insertar ingredientes</h4>
<p>Aqui va el contenido de cada punto.</p>
<h4>Editar ingredientes</h4>
<p>Aqui va el contenido de cada punto.</p>
<h4>Eliminar ingredientes</h4>
<p>Aqui va el contenido de cada punto.</p>
<h3>Notas de elaboraci&oacute;n</h3>
<h4>Edici&oacute;n de Notas</h4>
<p>Aqui va el contenido de cada punto.</p>
</body>
</html>
